#include <iostream>

/*
 * 0. Отрисовка
 *      -Толщина линии 1 шмиксель
 *      -Линии имеют разную толщину
 *      -Сглаживание
 * 1. Создать разные фигуры
 *      -Пример: отрезок
 *      -С координатами
 *      -Между другими фигурами
 *      -Пример: окружность
 *      -Соосные окружности
 *      -Касательная окружности
 * 2. Камера отображать разные части СК
 *      -Камера по-умолчанию
 *      -Привязка к фигуре
 *      -Привязка к позиции
 *      -Создать удалить поменять
 *      -Вывод нескольких камер
 *      -Камера по умолчанию в 2 места
 * 3. Операции с фигурами
 *      -Подвинуть на
 *      -Переместить в
 *      -Поворот
 *      -Рисование кривых/ косых линий
 *      -Комбинация
 *      -Слои и разные символы для разных слоев
 *      -Вычитание и сложение областей
 * 4. Сохранить/загрузить рабочую область
 *      -Открыть
 *      -Закрыть
 *      -Удалить
 *      -Состояние
 * 5. Метакоманды
 *      -help/описание
 *      -Макросы (без параметров)
 *      -Макросы с параметрами
 *      -Макросы с именованными параметрами
 *      -Чтение команд из файла
 *      -Сохранение/загрузка макросов в/из файла
 * 6. Цветная печать
 * 7. Экспорт пнг и импорт
 * 8. Экспорт в свг
 * 9. Отрисовка текста (разного размера)
 * 10. Что-то еще
 */


int main()
{

}